Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh94-v2.tmx
Source language: bo
Languages: en

source: སེམས་ཅན་ལ་དམིགས་པའི་སྦྱིན་པ་དང་། ཚུལ་ཁྲིམས་དང་། བཟོད་པ་དང་། བརྩོན་འགྲུས་དང་། བསམ་གཏན་དང་། ཤེས་རབ་གང་ཡིན་པ་འདི་དག་ནི་འཇིག་རྟེན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཅེས་བྱའོ། །
en: They are generosity, discipline, patience, diligence, concentration, and insight that are focused on sentient beings.

source: དེ་ལ་སེམས་ཅན་ལ་དམིགས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections focused on sentient beings?

source: སེམས་ཅན་རྣམས་སྦྱིན་པས་སྡུད་པར་བྱེད་པ་ན། བྱང་ཆུབ་ཀྱི་ཕྱིར་གདམས་ངག་མི་སྟོན་པར་སེམས་ཅན་འདི་དག་བདེ་བར་གྱུར་ཅིག་པ་དེ་ནི་སེམས་ཅན་ལ་དམིགས་པའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: Generosity focused on sentient beings occurs when in the process of gathering sentient beings by means of generosity one does not give instructions for the sake of awakening but instead forms the wish that these beings may be happy.

source: ཚུལ་ཁྲིམས་ཀྱིས་སེམས་ཅན་བདེ་བར་བྱེད་པ་དེ་ནི་སེམས་ཅན་ལ་དམིགས་པའི་ཚུལ་ཁྲིམས་སོ། །
en: Discipline focused on sentient beings is the process of making sentient beings happy through discipline.

source: སྟོང་པ་ཉིད་ཤེས་པ་མེད་པར་སེམས་ཅན་ཐམས་ཅད་ལ་བཟོད་པར་བྱེད་པ་དེ་ནི་སེམས་ཅན་ལ་དམིགས་པའི་བཟོད་པའོ། །
en: Patience focused on sentient beings means being patient with all sentient beings while not knowing emptiness.

source: སེམས་ཅན་རྣམས་རྣམ་པར་གྲོལ་བར་བྱ་བའི་ཕྱིར་བརྩོན་འགྲུས་རྩོམ་པ་དེ་ནི་སེམས་ཅན་ལ་དམིགས་པའི་བརྩོན་འགྲུས་སོ། །
en: Diligence focused on sentient beings is diligence for the sake of the liberation of all sentient beings.

source: སེམས་ལ་འཛིན་པ་མེད་པར་བྱ་བའི་ཕྱིར་བདག་ཏུ་དམིགས་པའི་བསམ་གཏན་སེམས་ལ་འཛིན་པ་མེད་པ་དེ་ནི་སེམས་ཅན་ལ་དམིགས་པའི་བསམ་གཏན་ནོ། །
en: Concentration focused on sentient beings is the abandonment of all mental grasping in the form of concentration that apprehends a self in order to make the mind devoid of grasping.

source: དམིགས་པའི་འདུ་ཤེས་དང་ལྡན་པའི་ཤེས་རབ་ཀྱིས་སེམས་ཅན་རྣམས་བསྐྱབ་པའི་ཕྱིར། བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྔོ་ཞིང་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པར་བྱ་བ་གང་ཡིན་པ་དེ་ནི་སེམས་ཅན་ལ་དམིགས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: The six perfections focused on sentient beings is the dedication to awakening and accomplishing complete and perfect buddhahood in order to protect all sentient beings through insight that involves notions based on apprehension.

source: དེ་ལ་གནས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six abiding perfections?

source: ཡི་དམ་ལ་བརྟན་པ་ལྷག་པའི་བསམ་པས་བྱང་ཆུབ་ཀྱི་ཕྱིར་ཡོངས་སུ་བསྔོས་པ་གང་ཡིན་པ་དེ་ནི་བྱང་ཆུབ་ཀྱི་ཕྱིར་གནས་པའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: Abiding in the perfection of generosity for the sake of awakening is that which is dedicated to awakening by means of firm resolve and superior intention.

source: རྟོག་པ་མེད་པའི་ཚུལ་ཁྲིམས་བྱང་ཆུབ་ཀྱི་ཕྱིར་ཡོངས་སུ་སྔོ་ཞིང་བཅབས་པ་མེད་པ་དེ་ནི་བྱང་ཆུབ་ཀྱི་ཕྱིར་གནས་པའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: Abiding in the perfection of discipline for the sake of awakening is nonconceptual discipline that is dedicated to awakening and does not conceal anything.

source: ནམ་བྱང་ཆུབ་ཀྱི་བར་དུ་སྡུག་བསྔལ་ཐམས་ཅད་བཟོད་པ་བརྟན་པར་སྨོན་པ་དེ་ནི་བྱང་ཆུབ་ཀྱི་ཕྱིར་གནས་པའི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: Abiding in the perfection of patience for the sake of awakening is the firm aspiration to accept all the sufferings of sentient beings until they achieve awakening.

source: ནམ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་མ་ཐོབ་ཀྱི་བར་དུ་བསྐལ་པ་གྲངས་མེད་པའི་བར་དུ་སྤྱོད་པ་རྒྱུན་མ་བཅད་པ་དེ་ནི་བྱང་ཆུབ་ཀྱི་ཕྱིར་གནས་པའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: Abiding in the perfection of diligence for the sake of awakening is continuous practice throughout incalculable eons until the achievement of omniscience.

source: དམིགས་སུ་མེད་པས་རབ་ཏུ་ཕྱེ་བ་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཆོས་ཀྱི་འདུ་ཤེས་རབ་ཏུ་ཕྱེ་བ་མ་ཡིན་ཞིང་བྱང་ཆུབ་ཁོང་དུ་ཆུད་པ་དེ་ནི་བྱང་ཆུབ་ཀྱི་ཕྱིར་གནས་པའི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: Abiding in the perfection of concentration for the sake of awakening is the perfection of concentration that knows awakening and is distinguished in terms of the absence of apprehension—not in terms of any perception of phenomena.

source: ནམ་བྱང་ཆུབ་ཀྱི་བར་དུ་ཆོས་ཐམས་ཅད་ལ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་། བརྟག་ཏུ་མེད་པས་རབ་ཏུ་ཕྱེ་བ་ཇི་ལྟ་བ་བཞིན་མངོན་པར་རྟོགས་པ་དེ་ནི་བྱང་ཆུབ་ཀྱི་ཕྱིར་གནས་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ།
en: Abiding in the perfection of insight for the sake of awakening is the correct realization that endures through to awakening and recognizes that all phenomena are distinguished by way of their inconceivability and continuous absence.

source: འདི་དག་ནི་གནས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཅེས་བྱའོ། །
en: Such are the six abiding perfections.

source: དེ་ལ་འཁོར་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections for saṃsāra?

source: ནམ་བྱང་ཆུབ་ཀྱི་བར་དུ་འཁོར་བ་ན་ལོངས་སྤྱོད་ཆེན་པོ་འཐོབ་པའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཟད་པར་མི་འགྱུར་བ་གང་ཡིན་པ་དེ་ནི་འཁོར་བར་ཡོངས་སུ་བསྔོས་པའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of generosity dedicated to saṃsāra is the inexhaustible perfection of generosity that delivers vast enjoyments within saṃsāra right up to awakening.

source: ཚེའི་ཚད་ཡོངས་སུ་རྫོགས་པའི་བར་དུ་འཁོར་བ་ན་གནས་པ་གང་ཡིན་པ་དེ་ནི་འཁོར་བར་ཡོངས་སུ་བསྔོས་པའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of discipline dedicated to saṃsāra is that which endures within saṃsāra for the full duration of one’s lifespan.

source: གནོད་སེམས་མེད་པར་ཕ་རོལ་ལ་སྙིང་བརྩེ་བའི་སྤྱོད་པས་ཉེ་བར་གནས་པ་གང་ཡིན་པ་དེ་ནི་འཁོར་བར་ཡོངས་སུ་བསྔོས་པའི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of patience dedicated to saṃsāra is to be free from animosity and to engage with others out of love.

source: བསྐལ་པ་གྲངས་མེད་པར་སྐྱོ་བ་མེད་པས་དགེ་བའི་ཆོས་རྣམས་ལ་སྦྱོར་བ་གང་ཡིན་པ་དེ་ནི་འཁོར་བར་ཡོངས་སུ་བསྔོས་པའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of diligence dedicated to saṃsāra is untiring engagement with the phenomena of virtue through incalculable eons.

source: སྐྱེ་བ་ལ་དམིགས་པའི་བསམ་གཏན་གང་ཡིན་པ་དེ་ནི་འཁོར་བར་ཡོངས་སུ་བསྔོས་པའི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of concentration dedicated to saṃsāra is concentration focused on birth.

source: ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་དག་ལྷག་པར་མཐོང་བའི་ཆེད་དུ་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོ་བ་དང་། ལས་ཀྱི་གནས་དང་། བཟོའི་གནས་ཐམས་ཅད་ལ་ཇི་ལྟ་བ་བཞིན་ཤེས་པ་གང་ཡིན་པ་དེ་ནི་འཁོར་བར་ཡོངས་སུ་བསྔོས་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of insight dedicated to saṃsāra consists of dedication directed at awakening in order to gain special insight into these perfections, as well as genuine knowledge of crafts and arts.

source: དེ་ལ་ཀུན་ནས་ཉོན་མོངས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of defilement?

source: འདོད་པའི་ཡོན་ཏན་སྔོན་དུ་བཏང་སྟེ། སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་ནི་དཔེར་ན་སེང་གེའི་རྒྱལ་པོའི་བུས་ཆུང་མ་སྟོང་ཕྲག་བརྒྱད་ཅུ་རྩ་བཞི་པོ་རྣམས། ནམ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བྱང་ཆུབ་ལ་མ་བཀོད་ཀྱི་བར་དུ་སྐྱབས་གསུམ་དུ་འགྲོ་ཞིང་མིའི་གནས་ན་འཁོད་པ་གང་ཡིན་པ་དེ་ནི་ཀུན་ནས་ཉོན་མོངས་པ་ལ་དམིགས་པའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of generosity focused on defilements is the ripening of sentient beings that is preceded by sense pleasures—just as in the example of the lion prince who established his eighty-four thousand consorts in human life and refuge in the Three Jewels until their attainment of omniscient awakening.

source: དཔེར་ན་རྭ་གཅིག་པའི་རྫིང་བུར་སེམས་ཅན་ལ་དམིགས་པའི་ཚུལ་ཁྲིམས་འདི་བྱམས་པས་ཡོངས་སུ་བསྔོས་པ་གང་ཡིན་པ་དེ་ནི་ཀུན་ནས་ཉོན་མོངས་པ་ལ་དམིགས་པའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of discipline focused on defilements is that which is dedicated with love—like in the example of the discipline focused on sentient beings, which was practiced at the pond of Ekaśṛṅga.

source: ཕ་རོལ་དང་འཐུན་པར་བྱ་བའི་ཕྱིར་འདོད་པའི་ཡོན་ཏན་ལ་མི་སྨོད་པ་གང་ཡིན་པ་དེ་ནི་ཀུན་ནས་ཉོན་མོངས་པ་ལ་དམིགས་པའི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of patience focused on defilements is that which aims to be in harmony with others and therefore does not despise sense pleasures.

source: བརྩོན་འགྲུས་ཀྱིས་ཕ་རོལ་སྐྲག་པར་བྱེད་དེ། དཔེར་ན་ཀུ་ཤའི་རྒྱལ་པོའི་བུའི་རྟོགས་པ་བརྗོད་པ་ལས་རྒྱ་ཆེར་ཤེས་པར་བྱ་བ་གང་ཡིན་པ་དེ་ནི་ཀུན་ནས་ཉོན་མོངས་པ་ལ་དམིགས་པའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of diligence focused on defilements is to frighten others with diligence, just as can be learned in detail from the account of Prince Kuśa.

source: བདག་ཏུ་ལྟ་བ་ལས་བྱུང་བའི་བསམ་གཏན་ངར་འཛིན་པ་གང་ཡིན་པ་དེ་ནི་ཀུན་ནས་ཉོན་མོངས་པ་ལ་དམིགས་པའི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of concentration focused on defilements is concentration that apprehends a self and arises from a view that regards a self.

source: ཤེས་རབ་ཀྱིས་ཆོ་ལོ་དང་། རྒྱན་པོ་དང་། བྱ་ལོང་གི་རྩེད་མོ་ལ་མངོན་པར་དགའ་ཞིང་ཡེ་ཤེས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དམིགས་པ་དང་བཅས་པས་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོ་བ་གང་ཡིན་པ་དེ་ནི་ཀུན་ནས་ཉོན་མོངས་པ་ལ་དམིགས་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of insight focused on defilements is to delight in gambling, gaming, and dice playing by means of insight, while being dedicated to awakening by means of the perfection of wisdom that involves observations.

source: དེ་ལ་གཞན་ལ་ཕན་འདོགས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of benefiting others?

source: འདོད་པའི་ཡོན་ཏན་གྱིས་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་གང་ཡིན་པ་དེ་ནི་གཞན་ལ་ཕན་འདོགས་པའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of generosity that benefits others is to ripen sentient beings by means of sense pleasures.

source: བྱམས་པས་གཞན་ལ་གནོད་པར་མི་གནས་པ་གང་ཡིན་པ་དེ་ནི་གཞན་ལ་ཕན་འདོགས་པའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of discipline that benefits others is discipline that, out of love, avoids harming others.

source: ཆོས་དེ་ལ་བཟོད་ཅིང་མི་སྨོད་པ་གང་ཡིན་པ་དེ་ནི་གཞན་ལ་ཕན་འདོགས་པའི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of patience that benefits others is that of accepting the Dharma and not despising it.

source: ལྷ་དང་མིའི་རིས་ཀྱི་ཕུན་སུམ་ཚོགས་པ་སྒྲུབ་པར་འགྱུར་བའི་བརྩོན་འགྲུས་ནི། དཔེར་ན་བརྒྱ་བྱིན་གྱིས་གསོལ་བ་བཏབ་པས། བྲམ་ཟེ་ཆེན་པོ་ཀིན་ཏུ་ཞེས་བྱ་བས་སེམས་ཅན་རྣམས་མཐོ་རིས་སུ་བཀྱེ་བ་གང་ཡིན་པ་དེ་ནི་ཕན་འདོགས་པས་ཡོངས་སུ་བསྔོས་པའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of diligence that is dedicated through acts of help refers to diligence that accomplishes perfect circumstances in the realms of gods and humans—for example, the way the great brahmin Kintu brought sentient beings to birth in the higher realms at the request of Śakra.

source: ཆོས་དེ་ལ་སེམས་ཀྱིས་སྦྱོར་བ་གང་ཡིན་པ་དེ་ནི་གཞན་ལ་ཕན་འདོགས་པའི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of concentration that benefits others is mental engagement with the Dharma.

source: བྱང་ཆུབ་ཀྱི་ཕྱིར་ཡང་དག་པར་འཛིན་དུ་འཇུག་ཅིང་རྐྱེན་དེ་དག་གིས་སེམས་ཅན་ཚིམ་པར་བྱེད་པ་གང་ཡིན་པ་དེ་ནི་གཞན་ལ་ཕན་འདོགས་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ།། །།
en: The perfection of insight that benefits others is engagement for the sake of awakening and satisfying sentient beings through those conditions.

source: དེ་ལ་གནས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections having supports?

source: དམིགས་པར་ལྷུང་བའི་སྦྱིན་པ་རྣམ་པར་བགེད་པ་ལ་རེ་བས་ཕྱེ་བ་གང་ཡིན་པ་དེ་ནི་གནས་ཀྱི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of generosity having supports is generosity that strays into apprehension so that one distributes things while putting hope in such allocations.

source: དངོས་པོ་ལ་གནས་པའི་ཚུལ་ཁྲིམས་གང་ཡིན་པ་དེ་ནི་གནས་ཀྱི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of discipline having supports is discipline that is based on entities.

source: སེམས་ཅན་ལ་དམིགས་པའི་བཟོད་པ་གང་ཡིན་པ་དེ་ནི་གནས་ཀྱི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of patience having supports is patience focused on sentient beings.

source: རྣམ་པར་རྟོག་པ་ཅན་གྱི་བརྩོན་འགྲུས་གང་ཡིན་པ་དེ་ནི་གནས་ཀྱི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of diligence having supports is diligence that involves conceptual thought.

source: བདག་ཏུ་ཞུགས་པའི་བསམ་གཏན་གང་ཡིན་པ་དེ་ནི་གནས་ཀྱི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of concentration having supports is concentration that adheres to a self.

source: ཞི་བ་དང་ཉེ་བར་མ་ཞི་བའི་ཆོས་རྣམས་ལ་རྟོགས་པས་རབ་ཏུ་ཕྱེ་ཞིང་ཀུན་ནས་དཀྲིས་པར་འདུག་པ་གང་ཡིན་པ་དེ་ནི་གནས་ཀྱི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ།
en: The perfection of insight having supports is insight that discriminates by conceptualizing phenomena that are quelled or not quelled, and that thus remains entangled.

source: འདི་དག་ནི་གནས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections having supports.

source: དེ་ལ་བྱང་ཆུབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of awakening?

source: བྱང་ཆུབ་ཀྱི་ཕྱིར་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་དང་རབ་ཏུ་ལྡན་པའི་སྦྱིན་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of generosity is generosity that is endowed with the acceptance that phenomena are nonarising for the sake of awakening.

source: ལུས་དང་སེམས་ལ་མི་དམིགས་པའི་ཚུལ་ཁྲིམས་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of discipline is discipline focused on neither body nor mind.

source: ཆོས་རྣམས་ལ་ཇི་ལྟ་བ་བཞིན་དུ་བཟོད་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of patience is patience that accepts phenomena just as they are.

source: ལུས་དང་སེམས་ལ་མི་དམིགས་པར་གནས་པའི་བརྩོན་འགྲུས་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of diligence is diligence that remains free from focusing on body or mind.

source: ཆོས་ལ་མཉམ་པ་ཉིད་དང་ལྡན་པའི་སེམས་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of concentration is a mind of equality with respect to all phenomena.

source: ཆོས་ཐམས་ཅད་ལ་ཇི་ལྟ་བ་བཞིན་དུ་ཡོངས་སུ་ཤེས་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ།
en: The perfection of insight is correct knowledge with respect to all phenomena.

source: འདི་དག་ནི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections that are dedicated to awakening.

source: དེ་ལ་ཡེ་ཤེས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of wisdom?

source: རྒྱུན་མི་འཆད་པར་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་ཐབས་མཁས་པས་རབ་ཏུ་ཕྱེ་བ་གང་ཡིན་པ་དེ་ནི་ཡེ་ཤེས་ཀྱི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of generosity based on wisdom is skillful giving in order to continuously ripen sentient beings.

source: ཇི་ལྟར་ཚིགས་སུ་བཅད་པ་ལྔ་བརྒྱ་བྱ་བ་དང་། ཡ་མཚན་ཅན་དགུ་བཅུ་རྩ་དྲུག་པོ་ཐམས་ཅད་རྣམ་པར་སྤོང་བས་རབ་ཏུ་ཕྱེ་བ་སྡུག་བསྔལ་སྤང་བ་དང་། ཡང་དག་པའི་ལྟ་བ་སྤང་བར་བྱ་བ་མ་ཡིན་པས་རབ་ཏུ་ཕྱེ་བ་དང་། བདེ་འགྲོ་སྒྲུབ་པར་བྱེད་པ་གང་ཡིན་པ་དེ་ནི་ཡེ་ཤེས་ཀྱི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of discipline based on wisdom is to clearly distinguish by adopting the five hundred verses and abandoning the ninety-six heretics, to clearly distinguish by abandoning suffering and not abandoning the correct view, and to thus attain the higher realms.

source: ཡེ་ཤེས་ཀྱི་རྣམ་པས་སྡུག་བསྔལ་བཟོད་ཅིང་གང་དག་འདོད་ཆགས་མི་སྨོད་པར་ཕ་རོལ་པོ་ཡོངས་སུ་སྨིན་པར་བྱེད་པས་ཕྱེ་བ་གང་ཡིན་པ་དེ་ནི་ཡེ་ཤེས་ཀྱི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of patience based on wisdom is the employment of wisdom to ripen others by accepting suffering and not reviling the desirous.

source: ཇི་ལྟར་རྟའི་རྒྱལ་པོ་རྔོག་ལྡན་བདག་ཉིད་སྡུག་བསྔལ་དང་དུ་ལེན་ཅིང་གང་དག་བརྩོན་འགྲུས་ཀྱིས་བདག་དང་གཞན་ལ་ཕན་པ་དང་བདེ་བའི་ཕྱིར་གནས་པ་འདི་ལྟར་འགྲོན་པ་ལྔ་བརྒྱ་ཐར་བར་བྱས་པ་དང་། འདི་ལྟར་རི་དགས་ཀྱི་རྒྱལ་པོ་སེང་གེས་འགྲོན་པ་རྣམས་ཐར་བར་བྱས་པ་གང་ཡིན་པ་དེ་ནི་ཡེ་ཤེས་ཀྱི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of diligence based on wisdom is like the king of horses, Keśin, who gladly accepted suffering for himself in order to bring welfare and happiness to both himself and others, thus delivering five hundred travelers, or like the lion, king of beasts, who saved the travelers.

source: བསམ་གཏན་ཡང་བསྐྱེད། གཟུགས་མེད་པ་ཡང་བསྐྱེད། ཉན་ཐོས་ཀྱི་ཆོས་ཀྱང་བསྐྱེད་མོད་ཀྱི། གང་དག་དེ་དག་གིས་ངེས་པར་མི་འབྱུང་བ་གང་ཡིན་པ་དེ་ནི་ཡེ་ཤེས་ཀྱི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of concentration based on wisdom gives rise to the concentrations, formless states, and the qualities of the hearers, but without this resulting in one trying to escape.

source: ཡེ་ཤེས་ཀྱིས་ཆོས་ཇི་ལྟ་བའི་ཕྱིར་འདི་ལྟར་སྨན་ཆེན་པོ་དང་། འདི་ལྟར་བྱང་ཆུབ་ཀུན་ཏུ་རྒྱུའི་མི་དགེ་བ་བཅུ་རྣམ་པར་སྤོང་བ་སེམས་ཅན་སུ་ལ་ཡང་མེད་པ་གང་ཡིན་པ་དེ་ནི་ཡེ་ཤེས་ཀྱི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of insight based on wisdom is the great medicine that correctly apprehends phenomena by means of wisdom, moves toward awakening by relinquishing unvirtuous phenomena, and is beyond the domain of any sentient being.

source: དེ་ལ་བདག་ལ་ཕན་འདོགས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections that benefit oneself?

source: བདག་ལོངས་སྤྱོད་ཆེན་པོ་འགྲུབ་པར་ཡོངས་སུ་བསྔོས་པ་གང་ཡིན་པ་དེ་ནི་བདག་ལ་ཕན་འདོགས་པའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of generosity that benefits oneself is generosity dedicated to the accomplishment of great enjoyments for oneself.

source: བདེ་འགྲོ་ལྷ་དང་མིར་སྐྱེ་བར་བསྒྲུབ་པའི་ཚུལ་ཁྲིམས་གང་ཡིན་པ་དེ་ནི་བདག་ལ་ཕན་འདོགས་པའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of discipline that benefits oneself is discipline that results in life within the higher realms, as a human or a god.

source: བཟོད་པ་ཐོབ་པའི་རྣམ་པར་སྨིན་པའི་མཛེས་ཤིང་ཁ་དོག་མཆོག་ཏུ་རྒྱས་པ་ཐོབ་པ་དང་། དབང་ཆེ་བར་གྲགས་པར་འགྱུར་བ་གང་ཡིན་པ་དེ་ནི་བདག་ལ་ཕན་འདོགས་པའི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of patience that benefits oneself is the accomplishment of patience that ripens as an attractive physique and complexion, charisma, and renown.

source: བྱང་ཆུབ་ཀྱི་ཕྱིར་གཞན་ལ་རག་མ་ལས་པར་སྤྱོད་ཅིང་བདག་ཉིད་ཀྱི་བརྩོན་འགྲུས་ཀྱིས་དཔྱོད་པར་བྱེད་པ་གང་ཡིན་པ་དེ་ནི་བདག་ལ་ཕན་འདོགས་པའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of diligence that benefits oneself is one’s independent and diligent practice for the sake of awakening and one’s own diligent discernment.

source: བསམ་གཏན་བསྐྱེད་པས་འཇིག་པའི་བསྐལ་པ་དང་། འཆགས་པའི་བསྐལ་པ་བདུན་གྱི་བར་དུ་འཇིག་རྟེན་འདིར་མི་འོང་བ་གང་ཡིན་པ་དེ་ནི་བདག་ལ་ཕན་འདོགས་པའི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of concentration that benefits oneself is to develop concentration so that one avoids taking birth in this world during the sevenfold eons of destruction and formation.

source: ཕ་རོལ་གྱི་ངོར་མི་ལྟ་ཞིང་ལུས་ཀྱི་ལས་དང་། ངག་གི་ལས་དང་། ཡིད་ཀྱི་ལས་བདེན་པའི་རྗེས་སུ་འཇུག་པ་གང་ཡིན་པ་དེ་ནི་བདག་ལ་ཕན་འདོགས་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ།
en: The perfection of insight that benefits oneself is to pursue physical, verbal, and mental actions in accord with the truth and without regard for the opinions of others.

source: འདི་དག་ནི་བདག་ལ་ཕན་འདོགས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections that benefit oneself.

source: དེ་ལ་འཐོབ་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of attainment?

source: སྦྱིན་པའི་རྣམ་པར་སྨིན་པ་ལོངས་སྤྱོད་ཆེན་པོ་འཐོབ་པ་གང་ཡིན་པ་འདི་དང་། བྱང་ཆུབ་ཀྱི་ཕྱིར་ཡོངས་སུ་བསྔོ་བ་གང་ཡིན་པ་དེ་ནི་འཐོབ་པའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of generosity based on attainment is generosity that ripens as the attainment of vast enjoyments and is dedicated to awakening.

source: རྙེད་པ་ཆེན་པོའི་ཕྱིར་སེམས་ལ་ཀུན་ནས་ཉོན་མོངས་པ་མེད་པ་གང་ཡིན་པ་དང་། བྱང་ཆུབ་ཀྱི་ཕྱིར་ཡོངས་སུ་བསྔོ་བ་གང་ཡིན་པ་དེ་ནི་འཐོབ་པའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of discipline based on attainment is discipline that is dedicated to awakening and free from mental defilement aimed at attaining wealth.

source: བྱང་ཆུབ་ཀྱི་ཕྱིར་གཞན་ལ་གནོད་པ་མི་བྱེད་ཅིང་དམ་པའི་ཆོས་ཡོངས་སུ་སྤོང་བར་མི་འགྱུར་བ་གང་ཡིན་པ་དེ་ནི་འཐོབ་པའི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of patience based on attainment is directed toward awakening and avoids bringing harm to others or giving up the sacred Dharma.

source: བརྟུན་པའི་བརྩོན་འགྲུས་ཚད་མེད་པ་གང་ཡིན་པ་དེ་ནི་འཐོབ་པའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of diligence based on attainment consists in boundless diligent exertion.

source: བྱ་བ་ཐམས་ཅད་མངོན་པར་བསྒྲུབ་པའི་ཏིང་ངེ་འཛིན་ཐོབ་པ་གང་ཡིན་པ་དེ་ནི་འཐོབ་པའི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of concentration based on attainment is an attainment of the absorption that allows the accomplishment of all activities.

source: ཆོས་ཐམས་ཅད་མཉམ་པ་ཉིད་དུ་རྟོགས་པ་གང་ཡིན་པ་དེ་ནི་འཐོབ་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ།
en: The perfection of insight based on attainment is the realization of the equality of all phenomena.

source: འདི་དག་ནི་འཐོབ་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of attainment.

source: དེ་ལ་རེ་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of hope?

source: དམིགས་པས་བསྐྱེད་པའི་སྦྱིན་པ་བྱང་ཆུབ་ཀྱི་ཕྱིར་ཡོངས་སུ་བསྔོས་པ་གང་ཡིན་པ་དེ་ནི་རེ་བའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of generosity based on hope is generosity that is generated by apprehension and is dedicated entirely to awakening.

source: ལུས་དང་ངག་དམིགས་པ་ཅན་གྱི་ཚུལ་ཁྲིམས་རྣམ་པར་སྨིན་པ་བྱང་ཆུབ་ཀྱི་ཕྱིར་སྦྱོར་བ་གང་ཡིན་པ་དེ་ནི་རེ་བའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of discipline based on hope is the ripening discipline that involves apprehending body and speech and is carried out for the sake of awakening.

source: ཇི་ལྟ་བ་བཞིན་མཐོང་བ་གང་ཡིན་པར་ཆོས་རྣམས་ལ་སོ་སོར་བརྟགས་པས་དང་དུ་ལེན་པ་གང་ཡིན་པ་དེ་ནི་རེ་བའི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of patience based on hope is correct perception and acceptance of phenomena based on analysis.

source: ལུང་དུ་མ་བསྟན་པའི་ཤེས་པས་ཆོས་དེ་དང་དེ་དག་ལ་བརྩོན་ཞིང་ཕ་རོལ་གནོན་པ་གང་ཡིན་པ་དེ་ནི་རེ་བའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of diligence based on hope is being diligent and industrious in the various teachings through knowledge of what is undetermined.

source: བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་བྱང་བར་བྱས་པས་སྤོང་བ་ལ་མཚན་མར་མི་འཛིན་པ་གང་ཡིན་པ་དེ་ནི་རེ་བའི་བསམ་པ་བསྐྱེད་པའི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of concentration based on developing the intention of hope is not grasping any marks with respect to the relinquishments because of having trained in the perfection of concentration.

source: ལུང་དུ་མ་བསྟན་པ་ཁོང་དུ་ཆུད་པར་བྱ་བའི་ཕྱིར། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྤྱི་བོར་སོན་པར་འགྱུར་རམ། མི་འགྱུར་རམ།
en: The perfection of insight based on hope is to think, in order to fathom what is undetermined, ‘Is it possible to reach the pinnacle of the perfection of insight or not?

source: ཡུན་ཇི་ཙམ་གྱིས་འགྱུར།
en: How long does it take?

source: སུ་ཞིག་གིས་འགྱུར་སྙམ་པ་གང་ཡིན་པ་དེ་ནི་རེ་བའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ། འདི་དག་ནི་རེ་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ །
en: Who might accomplish that?’ Such are the six perfections of hope.

source: དེ་ལ་རྣམ་པ་གསུམ་ལྟ་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of the threefold view?

source: འདུས་བྱས་ཀྱི་ཐབས་ཀྱང་རྒྱུན་མི་གཅོད་ལ། འབྲས་བུ་འདུས་མ་བྱས་སྦྱིན་པར་བྱེད་པ་གང་ཡིན་པ་དེ་ནི་རྣམ་པ་གསུམ་ལྟ་བའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of generosity based on the threefold view is a giving consisting in unceasing conditioned means but with a fruition that is unconditioned.

source: ལམ་ལ་ཞུགས་པའི་ཚུལ་ཁྲིམས་གང་ཡིན་པ་དེ་ནི་རྣམ་པ་གསུམ་ལྟ་བའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of discipline based on the threefold view is the discipline of someone who has embarked on the path.

source: ཕྱི་དང་ནང་གི་ཆོས་རྣམས་ལ་མི་རྟག་པ་དང་། སྡུག་བསྔལ་བ་དང་། བདག་མེད་པས་རབ་ཏུ་ཕྱེ་བ་གང་ཡིན་པ་དང་། ཆོས་འདི་དག་ལ་བཟོད་པ་གང་ཡིན་པ་དེ་ནི་རྣམ་པ་གསུམ་ལྟ་བའི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of patience based on the threefold view is that which discerns and accepts that all outer and inner phenomena are impermanent, painful, and devoid of self.

source: ཐོགས་པ་མེད་པའི་ཡེ་ཤེས་ཀྱི་དམིགས་པ་དང་ལྡན་ཞིང་ལྷག་མཐོང་སྔོན་དུ་འགྲོ་བའི་སེམས་ཀུན་ནས་ཉོན་མོངས་པ་མེད་པ་གང་ཡིན་པ་དེ་ནི་རྣམ་པ་གསུམ་ལྟ་བའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of diligence based on the threefold view is a mind free from emotional defilements that is endowed with the apprehension of unimpeded wisdom and preceded by special insight.
